app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      @all_ratings = Movie.ratings
      @ratings_hash = @all_ratings.map {|key| [key, 1]}.to_h
---
SELECT "movies".* FROM "movies"  ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date

    def create
      @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "v bhejlbibbenb vkj"], ["rating", "G"], ["release_date", "2021-10-01 00:00:00.000000"], ["created_at", "2021-10-01 00:16:39.138785"], ["updated_at", "2021-10-01 00:16:39.138785"]]